Obligatorio1/Central_Midd/src/main/resources/META-INF/integration/inputXML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.middleware.fing.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:recepcionPagos>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <fechaCobro>10/10/12</fechaCobro>
            <!--Optional:-->
            <formaPago>E</formaPago>
            <identificadorCliente>1</identificadorCliente>
            <numeroSucursal>1</numeroSucursal>
            <!--Zero or more repetitions:-->
            <pagos>
               <!--Optional:-->
               <codigoMoneda>UYU</codigoMoneda>
               <!--Zero or more repetitions:-->
               <datoAdicional>223231</datoAdicional>
               <identificadorPago>33443</identificadorPago>
               <monto>1243423</monto>
               <!--Optional:-->
               <nombreGestion>Factura</nombreGestion>
            </pagos>
         </arg0>
      </ser:recepcionPagos>
   </soapenv:Body>
</soapenv:Envelope>
